bolknote/MK61S_MINI/code/m61_text.cpp
#include "m61_text.hpp"

#include "bounded_string.hpp"
#include "mk61emu_core.h"
#include "program_store.hpp"
#include "terminal_core.hpp"
#include "terminal_script.hpp"

#ifndef M61_TEXT_HOST_TEST
#include "Arduino.h"
#include "library_pmk.hpp"
#include "storage_path.hpp"
#include "tools.hpp"
#else
bool OpenStoredFile(const char* args);
void hidden_start_loaded_program(void);
void MK61Emu_ClearCodePage(void);
u32 m61_text_host_millis(void);
#endif

#include <stdio.h>
#include <string.h>

namespace m61_text {

static constexpr u16 MAX_LINE_SIZE = (u16) terminal_core::MAX_INPUT_TEXT;
static constexpr u8 HIN_BYTES_PER_LINE = 24;
static constexpr u8 SCRIPT_STACK_DEPTH = 8;
static constexpr u8 SCRIPT_LINE_BUDGET = 8;
static constexpr u8 READ_CACHE_SIZE = 64;
static constexpr u8 MAX_LABELS = 64;
static constexpr u8 MAX_LABEL_SIZE = 31;
static constexpr u8 TRAP_ADDRESS_COUNT = (u8) core_61::MAX_PROGRAM_STEP;
static constexpr u8 TRAP_BITMAP_SIZE =
    (u8) ((core_61::MAX_PROGRAM_STEP + 7U) / 8U);
static constexpr u8 INVALID_TRAP_TARGET = 0xFF;
static constexpr u8 RETURN_STACK_DEPTH = SCRIPT_STACK_DEPTH + 1;

enum class RunnerState : u8 {
  IDLE,
  EXECUTING,
  WAIT_RUN_STOP,
  WAIT_TIME,
  WATCH_TRAPS
};

enum class ScriptSource : u8 {
  NONE,
  STORE
};

struct ScriptFrame {
  ScriptSource source;
  char name[program_store::NAME_SIZE];
  u16 id;
  u16 len;
  u16 pos;
  u16 line;
  u8 active_traps[TRAP_BITMAP_SIZE];
};

enum class ReturnKind : u8 {
  SCRIPT,
  LABEL,
  TRAP
};

struct ReturnFrame {
  ReturnKind kind;
  RunnerState runner_state;
  ScriptFrame script;
};

struct LabelEntry {
  u32 hash;
  u16 name_pos;
  u16 target_pos;
  u16 target_line;
  u8 len;
};

static RunnerState runner_state = RunnerState::IDLE;
static ScriptSource script_source = ScriptSource::NONE;
static char script_name[program_store::NAME_SIZE] = {};
static u16 script_id = program_store::INVALID_ID;
static u16 script_len = 0;
static u16 script_pos = 0;
static u16 script_line = 1;
static u8 active_traps[TRAP_BITMAP_SIZE] = {};
static ReturnFrame return_stack[RETURN_STACK_DEPTH];
static u8 return_stack_depth = 0;
static u8 script_stack_depth = 0;
static u8 read_cache[READ_CACHE_SIZE];
static u16 read_cache_start = 0;
static u8 read_cache_len = 0;
static LabelEntry labels[MAX_LABELS];
static u8 label_count = 0;
static u8 trap_targets[TRAP_ADDRESS_COUNT];
static bool trap_pending = false;
static u8 pending_trap_address = 0;
static u8 pending_trap_target = INVALID_TRAP_TARGET;
static bool trap_context_valid = false;
static core_61::ContextBuffer trap_context = {};
static u8 suspended_trap_address = 0;
static bool bypass_trap_once = false;
static u8 bypass_trap_address = 0;
static bool boundary_hook_installed = false;
static bool display_claimed = false;
static u32 wait_until_ms = 0;
static bool has_error = false;
static Error last_error_info = {};
static const char* line_error_message = NULL;

// Снимок ловушки фиксирует всё состояние ядра, включая единицу угла. Однако
// Р/Г/ГРД на корпусе играют роль внешнего переключателя: изменение, сделанное
// пользователем, пока обработчик ловушки держит кадр, должно пережить `ret`.
static bool restore_trap_context(void) {
  const AngleUnit selected_angle = MK61Emu_GetAngleUnit();
  if(!core_61::restore_context(trap_context)) return false;
  MK61Emu_SetAngleUnit(selected_angle);
  return true;
}

static bool is_line_end(char c) {
  return c == 0 || c == '\r' || c == '\n';
}

static bool is_space(char c) {
  return c == ' ' || c == '\t';
}

static const char* skip_spaces(const char* p) {
  while(is_space(*p)) p++;
  return p;
}

static bool token_ends(const char* p) {
  p = skip_spaces(p);
  return is_line_end(*p);
}

static u32 runner_millis(void) {
#ifndef M61_TEXT_HOST_TEST
  return millis();
#else
  return m61_text_host_millis();
#endif
}

static bool time_reached(u32 now, u32 deadline) {
  return (i32) (now - deadline) >= 0;
}

static void clear_error(void) {
  has_error = false;
  memset(&last_error_info, 0, sizeof(last_error_info));
}

static void invalidate_read_cache(void) {
  read_cache_start = 0;
  read_cache_len = 0;
}

template<usize N>
static void copy_script_name(char (&out)[N], const char* name) {
  bounded_string::copy(out, name);
}

static void clear_current_script(void) {
  script_source = ScriptSource::NONE;
  script_name[0] = 0;
  script_id = program_store::INVALID_ID;
  script_len = 0;
  script_pos = 0;
  script_line = 1;
  invalidate_read_cache();
  label_count = 0;
  memset(active_traps, 0, sizeof(active_traps));
  memset(trap_targets, INVALID_TRAP_TARGET, sizeof(trap_targets));
}

#ifdef M61_TEXT_HOST_TEST
static bool find_entry_by_type_name(program_store::ProgramType type, const char* name, program_store::Entry& out) {
  if(name == NULL || name[0] == 0) return false;
  const int count = program_store::count(type);
  for(int i = 0; i < count; i++) {
    program_store::Entry entry;
    if(!program_store::entry(type, i, entry)) continue;
    if(strncmp(entry.name, name, program_store::NAME_SIZE) == 0) {
      out = entry;
      return true;
    }
  }
  return false;
}
#endif

static void store_current_frame(ScriptFrame& frame) {
  frame.source = script_source;
  copy_script_name(frame.name, script_name);
  frame.id = script_id;
  frame.len = script_len;
  frame.pos = script_pos;
  frame.line = script_line;
  memcpy(frame.active_traps, active_traps, sizeof(active_traps));
}

static void restore_frame(const ScriptFrame& frame) {
  script_source = frame.source;
  copy_script_name(script_name, frame.name);
  script_id = frame.id;
  script_len = frame.len;
  script_pos = frame.pos;
  script_line = frame.line;
  memcpy(active_traps, frame.active_traps, sizeof(active_traps));
  invalidate_read_cache();
}

static bool make_store_frame(u16 id, ScriptFrame& frame) {
  program_store::Entry entry;
  if(!program_store::entry_by_id(id, entry) ||
     entry.kind != program_store::NodeKind::FILE ||
     entry.type != program_store::ProgramType::MK61) return false;
  frame.source = ScriptSource::STORE;
  copy_script_name(frame.name, entry.name);
  frame.id = entry.id;
  frame.len = entry.data_len;
  frame.pos = 0;
  frame.line = 1;
  memset(frame.active_traps, 0, sizeof(frame.active_traps));
  return true;
}

static bool make_store_frame(const char* name, ScriptFrame& frame) {
  if(name == NULL || name[0] == 0) return false;

#ifndef M61_TEXT_HOST_TEST
  // Имена вложенных сценариев сначала разрешаются в каталоге вызывающего
  // сценария. Это изолирует одноимённые сценарии в независимых деревьях
  // каталогов и позволяет использовать обычные относительные пути
  // (../lib/tool.m61).
  u16 cwd = program_store::ROOT_ID;
  if(script_id != program_store::INVALID_ID) {
    program_store::Entry current;
    if(program_store::entry_by_id(script_id, current)) cwd = current.parent_id;
  }

  program_store::Entry entry;
  if(storage_path::resolve_file(cwd, name,
      program_store::ProgramType::MK61, entry) == storage_path::Status::OK) {
    return make_store_frame(entry.id, frame);
  }

  // Раньше простые имена без пути считались глобальными. Сохраняем этот
  // запасной вариант, но не превращаем явно относительный путь в поиск
  // несвязанного файла в корневом каталоге.
  if(cwd != program_store::ROOT_ID && strchr(name, '/') == NULL &&
     strchr(name, '\\') == NULL &&
     storage_path::resolve_file(program_store::ROOT_ID, name,
       program_store::ProgramType::MK61, entry) == storage_path::Status::OK) {
    return make_store_frame(entry.id, frame);
  }
  return false;
#else
  program_store::Entry entry;
  if(script_id != program_store::INVALID_ID) {
    program_store::Entry current;
    if(program_store::entry_by_id(script_id, current)) {
      const int count = program_store::child_count(current.parent_id);
      for(int i = 0; i < count; i++) {
        program_store::Entry candidate;
        if(program_store::child(current.parent_id, i, candidate) &&
           candidate.kind == program_store::NodeKind::FILE &&
           candidate.type == program_store::ProgramType::MK61 &&
           strncmp(candidate.name, name, program_store::NAME_SIZE) == 0) {
          return make_store_frame(candidate.id, frame);
        }
      }
    }
  }

  return find_entry_by_type_name(program_store::ProgramType::MK61, name, entry) &&
         make_store_frame(entry.id, frame);
#endif
}

