bolknote/MK61S_MINI/code/m61_text.cpp
static bool trap_is_active(u8 address) {
  return address < TRAP_ADDRESS_COUNT &&
         (active_traps[address >> 3] &
          (u8) (1U << (address & 7U))) != 0;
}

static bool any_trap_is_active(void) {
  for(u8 value : active_traps) {
    if(value != 0) return true;
  }
  return false;
}

static bool build_label_index(const char*& error_message, u16& error_line) {
  const u16 resume_pos = script_pos;
  const u16 resume_line = script_line;
  script_pos = 0;
  script_line = 1;
  label_count = 0;
  invalidate_read_cache();

  char line[MAX_LINE_SIZE + 1];
  while(script_pos < script_len) {
    const u16 line_start = script_pos;
    const u16 line_number = script_line;
    if(!read_next_line(line, sizeof(line))) {
      error_message = "cannot read script or line is too long";
      error_line = line_number;
      return false;
    }
    const char* name = NULL;
    usize len = 0;
    const LabelParse parsed = parse_label(line, name, len);
    if(parsed == LabelParse::NONE) continue;
    if(parsed == LabelParse::INVALID) {
      error_message = "invalid label (use 1..31 non-space characters)";
      error_line = line_number;
      return false;
    }
    if(label_count >= MAX_LABELS) {
      error_message = "too many labels (maximum 64)";
      error_line = line_number;
      return false;
    }
    for(u8 i = 0; i < label_count; i++) {
      if(stored_label_equals(labels[i], name, len)) {
        error_message = "duplicate label";
        error_line = line_number;
        return false;
      }
    }

    LabelEntry& entry = labels[label_count++];
    entry.hash = label_hash(name, len);
    entry.name_pos = (u16) (line_start + (u16) (name - line));
    entry.target_pos = script_pos;
    entry.target_line = script_line;
    entry.len = (u8) len;
  }

  script_pos = resume_pos;
  script_line = resume_line;
  invalidate_read_cache();
  return true;
}

static bool build_trap_index(const char*& error_message, u16& error_line) {
  const u16 resume_pos = script_pos;
  const u16 resume_line = script_line;
  script_pos = 0;
  script_line = 1;
  memset(trap_targets, INVALID_TRAP_TARGET, sizeof(trap_targets));
  invalidate_read_cache();

  char line[MAX_LINE_SIZE + 1];
  while(script_pos < script_len) {
    const u16 line_number = script_line;
    if(!read_next_line(line, sizeof(line))) {
      error_message = "cannot read script or line is too long";
      error_line = line_number;
      return false;
    }

    ParsedTrap parsed = {};
    const TrapParse result = parse_trap(line, parsed);
    if(result == TrapParse::NONE) continue;
    if(result == TrapParse::INVALID) {
      error_message = "invalid trap (use: trap <0..111> run :label)";
      error_line = line_number;
      return false;
    }
    if(trap_targets[parsed.address] != INVALID_TRAP_TARGET) {
      error_message = "duplicate trap address";
      error_line = line_number;
      return false;
    }
    const i16 target = find_label_index(parsed.label, parsed.label_len);
    if(target < 0) {
      error_message = "trap label not found";
      error_line = line_number;
      return false;
    }
    trap_targets[parsed.address] = (u8) target;
  }

  script_pos = resume_pos;
  script_line = resume_line;
  invalidate_read_cache();
  return true;
}

static void discard_undefined_active_traps(void) {
  for(u8 address = 0; address < TRAP_ADDRESS_COUNT; address++) {
    if(trap_targets[address] == INVALID_TRAP_TARGET) {
      set_trap_active(address, false);
    }
  }
}

static bool activate_frame(const ScriptFrame& frame, const char*& error_message, u16& error_line) {
  restore_frame(frame);
  if(!build_label_index(error_message, error_line) ||
     !build_trap_index(error_message, error_line)) {
    return false;
  }
  // Повторный запуск того же корневого файла может принести активные биты из
  // предыдущего запуска. Если файл успели переписать, не оставляем адреса,
  // для которых в новой версии уже нет объявления и обработчика.
  discard_undefined_active_traps();
  return true;
}

static bool restore_return_frame(const ReturnFrame& returned) {
  const char* error_message = NULL;
  u16 error_line = 0;
  if(!activate_frame(returned.script, error_message, error_line)) {
    fail_script(error_message, error_line);
    return false;
  }
  terminal_script::reset();
  return true;
}

static bool return_from_script(void) {
  if(return_stack_depth == 0) {
    if(any_trap_is_active()) {
      runner_state = RunnerState::WATCH_TRAPS;
      wait_until_ms = 0;
      return true;
    }
    stop_runner();
    return true;
  }

  const ReturnFrame returned = return_stack[--return_stack_depth];
  if(returned.kind != ReturnKind::TRAP) {
    if(returned.kind == ReturnKind::SCRIPT && script_stack_depth > 0) {
      script_stack_depth--;
    }
    if(!restore_return_frame(returned)) return false;
    runner_state = returned.runner_state;
    return true;
  }

  if(!trap_context_valid || !restore_trap_context()) {
    fail_script("cannot restore calculator trap context", script_line);
    return false;
  }
  trap_context_valid = false;
  bypass_trap_once = true;
  bypass_trap_address = suspended_trap_address;
  suspended_trap_address = 0;
  if(!restore_return_frame(returned)) return false;
  runner_state = returned.runner_state;
  return true;
}

static void finish_script(void) {
  if(return_stack_depth > 0 &&
     return_stack[return_stack_depth - 1].kind == ReturnKind::TRAP) {
    fail_script("trap handler reached end of script without ret", script_line);
    return;
  }
  (void) return_from_script();
}

static bool open_store_script(const char* name) {
  ScriptFrame child;
  if(!make_store_frame(name, child)) return false;
  if(!push_current_frame(ReturnKind::SCRIPT)) return false;

  const char* error_message = NULL;
  u16 error_line = 0;
  if(!activate_frame(child, error_message, error_line)) {
    const ReturnFrame parent = return_stack[--return_stack_depth];
    if(script_stack_depth > 0) script_stack_depth--;
    restore_frame(parent.script);
    return false;
  }
  terminal_script::reset();
  MK61Emu_ClearCodePage();
  runner_state = RunnerState::EXECUTING;
  return true;
}

static bool open_store_script(u16 id) {
  ScriptFrame child;
  if(!make_store_frame(id, child)) return false;
  if(!push_current_frame(ReturnKind::SCRIPT)) return false;

  const char* error_message = NULL;
  u16 error_line = 0;
  if(!activate_frame(child, error_message, error_line)) {
    const ReturnFrame parent = return_stack[--return_stack_depth];
    if(script_stack_depth > 0) script_stack_depth--;
    restore_frame(parent.script);
    return false;
  }
  terminal_script::reset();
  MK61Emu_ClearCodePage();
  runner_state = RunnerState::EXECUTING;
  return true;
}

// Запуск загруженной программы прямо на ядре, ожидание останова — асинхронно
// из service(). Клавиши через буфер клавиатуры терялись бы при выходе из меню.
static bool start_current_program(void) {
  if(trap_context_valid) return false;
  const usize steps = core_61::program_steps();
  for(u8 address = 0; address < TRAP_ADDRESS_COUNT; address++) {
    if(trap_is_active(address) && address >= steps) return false;
  }
  runner_state = RunnerState::WAIT_RUN_STOP;
  // Взводим исполнитель до последнего скрытого шага С/П: один шаг ядра может
  // дойти до первого кода программы, особенно в турбо-сборках.
  hidden_start_loaded_program();
  return true;
}

// "load N" внутри сценария: слот выполняется как вложенный скрипт с возвратом
// на следующую строку (Load() терминала отменил бы текущий сценарий).
static bool open_slot(const char* args) {
  args = skip_spaces(args);
  usize slot = 0;
  usize digits = 0;
  while(args[digits] >= '0' && args[digits] <= '9') {
    slot = slot * 10 + (usize) (args[digits] - '0');
    digits++;
  }
  if(digits == 0 || slot > 99 || !token_ends(args + digits)) return false;

  char name[8];
  snprintf(name, sizeof(name), "%u", (unsigned) slot);
  return open_store_script(name);
}

// В обычном сценарии "run :метка" остаётся переходом и поддерживает циклы.
// В обработчике trap это локальный вызов: ret возвращает на строку после run,
// что позволяет вынести общий код кадра в одну метку.
static bool goto_label(const char* args) {
  args = skip_spaces(args);
  usize label_len = 0;
  while(!is_line_end(args[label_len]) && !is_space(args[label_len])) label_len++;
  if(label_len == 0 || label_len > MAX_LABEL_SIZE || !token_ends(args + label_len)) return false;

  const i16 target = find_label_index(args, label_len);
  if(target < 0) return false;
  if(trap_context_valid && !push_current_frame(ReturnKind::LABEL)) {
    line_error_message = "label return stack is full";
    return false;
  }
  const LabelEntry& entry = labels[target];
  script_pos = entry.target_pos;
  script_line = entry.target_line;
  invalidate_read_cache();
  return true;
}

static bool program_boundary_hook(
    const core_61::Mk61ProgramBoundaryContext& context, void*) {
  if((runner_state != RunnerState::WAIT_RUN_STOP &&
      runner_state != RunnerState::WATCH_TRAPS) ||
     !core_61::is_RUN()) {
    return false;
  }

  if(bypass_trap_once) {
    const bool bypass = context.address == bypass_trap_address;
    bypass_trap_once = false;
    if(bypass) return false;
  }

  if(!trap_is_active(context.address)) return false;
  const u8 target = trap_targets[context.address];
  if(target == INVALID_TRAP_TARGET || target >= label_count) return false;
  trap_pending = true;
  pending_trap_address = context.address;
  pending_trap_target = target;
  return true;
}

