bolknote/MK61S_MINI/code/m61_text.cpp
static bool enter_pending_trap(void) {
  if(!trap_pending || pending_trap_target >= label_count) return false;
  const u8 address = pending_trap_address;
  const u8 target = pending_trap_target;

  if(!push_current_frame(ReturnKind::TRAP)) {
    line_error_message = "trap return stack is full";
    return false;
  }
  if(!core_61::save_context(trap_context)) {
    return_stack_depth--;
    line_error_message = "cannot save calculator trap context";
    return false;
  }

  trap_pending = false;
  pending_trap_address = 0;
  pending_trap_target = INVALID_TRAP_TARGET;
  trap_context_valid = true;
  suspended_trap_address = address;

  const LabelEntry& entry = labels[target];
  script_pos = entry.target_pos;
  script_line = entry.target_line;
  invalidate_read_cache();
  runner_state = RunnerState::EXECUTING;
  return true;
}

static bool open_referenced_file(const char* path) {
#ifndef M61_TEXT_HOST_TEST
  u16 cwd = program_store::ROOT_ID;
  if(script_id != program_store::INVALID_ID) {
    program_store::Entry current;
    if(program_store::entry_by_id(script_id, current)) cwd = current.parent_id;
  }

  program_store::Entry entry;
  if(storage_path::resolve_file(cwd, path, entry) ==
     storage_path::Status::OK) {
    return OpenStoredEntry(entry);
  }
  // Совместимость со старыми сценариями без каталогов: простое имя, которого
  // нет рядом с вызывающим сценарием, всё ещё может обозначать файл в корне.
  // Для явно относительных путей переход к несвязанному объекту запрещён.
  return cwd != program_store::ROOT_ID && strchr(path, '/') == NULL &&
         strchr(path, '\\') == NULL &&
         storage_path::resolve_file(program_store::ROOT_ID, path, entry) ==
             storage_path::Status::OK &&
         OpenStoredEntry(entry);
#else
  return OpenStoredFile(path);
#endif
}

// Вся грамматика команд разбирается терминалом (единый диспетчер интерактивного
// и скриптового режимов). Сценарию терминал возвращает только действия,
// влияющие на поток выполнения: run, open, load, переходы по меткам.
static bool execute_script_line(const char* raw_line) {
  line_error_message = NULL;
  const char* line = skip_spaces(raw_line);
  if(is_line_end(*line)) return true;
  if(*line == ':') return true; // Метка — точка перехода, сама по себе ничего не делает

  ParsedTrap parsed_trap = {};
  const TrapParse trap_result = parse_trap(line, parsed_trap);
  if(trap_result == TrapParse::VALID) {
    set_trap_active(parsed_trap.address, true);
    return true;
  }
  if(trap_result == TrapParse::INVALID) {
    line_error_message = "invalid trap (use: trap <0..111> run :label)";
    return false;
  }

  const terminal_protocol::Result result =
      terminal_script::execute(line, trap_context_valid);
  switch(result.kind) {
    case terminal_protocol::ResultKind::OK:
      return true;
    case terminal_protocol::ResultKind::RUN_PROGRAM:
      if(start_current_program()) return true;
      line_error_message = trap_context_valid
          ? "cannot run calculator from a trap handler"
          : "active trap address is outside current program memory";
      return false;
    case terminal_protocol::ResultKind::OPEN_FILE:
      if(open_referenced_file(result.args)) return true;
      line_error_message = "cannot open referenced file";
      return false;
    case terminal_protocol::ResultKind::LOAD_SLOT:
      if(open_slot(result.args)) return true;
      line_error_message = "cannot load nested slot";
      return false;
    case terminal_protocol::ResultKind::GOTO_LABEL:
      if(goto_label(result.args)) return true;
      line_error_message = "label not found or invalid";
      return false;
    case terminal_protocol::ResultKind::WAIT:
      if(result.key <= 0 || result.key > 60000) {
        line_error_message = "invalid wait duration";
        return false;
      }
      wait_until_ms = runner_millis() + (u32) result.key;
      runner_state = RunnerState::WAIT_TIME;
      return true;
    case terminal_protocol::ResultKind::RETURN_SCRIPT:
      return return_from_script();
    case terminal_protocol::ResultKind::ERROR:
    case terminal_protocol::ResultKind::KEY:
      line_error_message = "terminal command failed";
      return false;
  }
  return false;
}

void service(void) {
  if(runner_state == RunnerState::WAIT_TIME) {
    if(!time_reached(runner_millis(), wait_until_ms)) return;
    wait_until_ms = 0;
    runner_state = RunnerState::EXECUTING;
  }

  if(trap_pending) {
    const u16 trap_line = script_line;
    if(!enter_pending_trap()) {
      fail_script(line_error_message == NULL ? "cannot enter trap handler" : line_error_message,
                  trap_line);
      return;
    }
  }

  if(runner_state == RunnerState::WAIT_RUN_STOP) {
    if(!core_61::is_CALC()) return;
    // Программа МК остановилась: управление возвращается к следующей строке сценария.
    core_61::clear_displayed();
    runner_state = RunnerState::EXECUTING;
  }

  // Бюджет строк на вызов: бесконечный цикл по меткам (run :метка) не должен
  // блокировать основной loop() - продолжение в следующей итерации.
  usize budget = SCRIPT_LINE_BUDGET;
  while(runner_state == RunnerState::EXECUTING) {
    if(budget-- == 0) return;
    if(script_pos >= script_len) {
      finish_script();
      return;
    }

    const u16 line_number = script_line;
    char line[MAX_LINE_SIZE + 1];
    if(!read_next_line(line, sizeof(line))) {
      fail_script("cannot read script or line is too long", line_number);
      return;
    }
    if(!execute_script_line(line)) {
      fail_script(line_error_message == NULL ? "command failed" : line_error_message, line_number);
      return;
    }
  }
}

static bool load_frame(const ScriptFrame& frame) {
  ScriptFrame next = frame;
  const bool restart_same_root =
      runner_state == RunnerState::WATCH_TRAPS &&
      return_stack_depth == 0 &&
      script_source == ScriptSource::STORE &&
      frame.source == ScriptSource::STORE &&
      script_id == frame.id;
  if(restart_same_root) {
    memcpy(next.active_traps, active_traps, sizeof(active_traps));
  }
  if(active()) stop_runner();
  clear_error();

  const char* error_message = NULL;
  u16 error_line = 0;
  if(!activate_frame(next, error_message, error_line)) {
    fail_script(error_message, error_line);
    return false;
  }
  return_stack_depth = 0;
  script_stack_depth = 0;
  display_claimed = false;
  wait_until_ms = 0;
  clear_trap_runtime(false);
  if(!core_61::set_mk61_program_boundary_hook(program_boundary_hook, NULL)) {
    fail_script("calculator boundary hook is unavailable", 0);
    return false;
  }
  boundary_hook_installed = true;
  terminal_script::reset();
  MK61Emu_ClearCodePage();
  runner_state = RunnerState::EXECUTING;
  service();
  return !has_error;
}

bool load_program(const char* name) {
  if(name == NULL || name[0] == 0) return false;
  ScriptFrame frame;
  if(!make_store_frame(name, frame)) {
    copy_script_name(script_name, name);
    fail_script("script not found", 0);
    return false;
  }
  return load_frame(frame);
}

bool load_program(u16 id) {
  ScriptFrame frame;
  if(!make_store_frame(id, frame)) return false;
  return load_frame(frame);
}

